/*
* @file Practice2020.cpp
* @author Даценко В. А., гр. 515в
* @date 22.06.2020
* @brief Навчальна практика
*
* Конвертація дати
*/

#include <stdio.h>
#include <locale.h>
#include <Windows.h>
#include "fakedata.h" //библиотека прототипа функции fakedata
#define _CRT_SECURE_NO_WARNINGS

const char monthes[][13] = { "січня", "лютого", "березня", "квітня", "травня", "червня", "липня", "серпня", "вересня", "жовтня", "листопада", "грудня" }; // Сталый символьный массив с перечнем месяцев
const char days[][32] = { "Перше", "Друге", "Третє", "Четверте", "П'яте", "Шосте", "Сьоме", "Восьме", "Дев'яте", "Десяте", "Одинадцяте", "Дванадцяте", 
                            "Тринадцяте", "Чотирнадцяте", "П'ятнадцяте", "Шістнадцяте", "Сімнадцяте", "Вісімнадцяте", "Дев'ятнадцяте", "Двадцяте", 
                                "Двадцяць перше", "Двадцять друге", "Двадцять третє", "Двадцять четверте", "Двадцять п'яте", "Двадцять шосте", 
                                    "Двадцять сьоме", "Двадцять восьме", "Двадцять дев'яте", "Тридцяте", "Тридцять перше" }; // Сталый символьный массив с перечнем дней
int main()
{
    SetConsoleOutputCP(1251); // Устанавливает кодировку вывода на консоль (кириллица)
    setlocale(LC_ALL, "866"); // Устанавливает кодовую таблицу CP866
    int day, month;
    printf("Конвертація дати\nУвага! Якщо буде введено більше 4 цифр,\nїх залишок буде проігноровано.\n");
    anothertry: // метка для повторного ввода 
    printf("Уведіть дату кінця світу у форматі ДД ММ: "); // Ввод даты
    scanf("%d%2d", &day, &month);
    if (fakedata(day, month) == 0) // Проверка даты на корректность с помощью функциии fakedata
    {
        printf("Ви ввели некорректну дату, будь ласка спробуйте ще раз.\n"); scanf("%*[^\n]"); goto anothertry; //переход к метке для повторного ввода
    }
    else
        printf("Людство загине %s %s\n", days[day - 1], monthes[month - 1]); // Вывод даты
    system("pause");
    return 0;
}
