/*
* @file Practice2020.cpp
* @author ƒаценко ¬. ј., гр. 515в
* @date 22.06.2020
* @brief Ќавчальна практика
*
*  онвертац≥€ дати
*/

#include <stdio.h>
#include <locale.h>
#include <Windows.h>
#include "fakedata.h" //библиотека прототипа функции fakedata
#define _CRT_SECURE_NO_WARNINGS

const char monthes[][13] = { "с≥чн€", "лютого", "березн€", "кв≥тн€", "травн€", "червн€", "липн€", "серпн€", "вересн€", "жовтн€", "листопада", "грудн€" }; // —талый символьный массив с перечнем мес€цев
const char days[][32] = { "ѕерше", "ƒруге", "“ретЇ", "„етверте", "ѕ'€те", "Ўосте", "—ьоме", "¬осьме", "ƒев'€те", "ƒес€те", "ќдинадц€те", "ƒванадц€те", 
                            "“ринадц€те", "„отирнадц€те", "ѕ'€тнадц€те", "Ў≥стнадц€те", "—≥мнадц€те", "¬≥с≥мнадц€те", "ƒев'€тнадц€те", "ƒвадц€те", 
                                "ƒвадц€ць перше", "ƒвадц€ть друге", "ƒвадц€ть третЇ", "ƒвадц€ть четверте", "ƒвадц€ть п'€те", "ƒвадц€ть шосте", 
                                    "ƒвадц€ть сьоме", "ƒвадц€ть восьме", "ƒвадц€ть дев'€те", "“ридц€те", "“ридц€ть перше" }; // —талый символьный массив с перечнем дней
int main()
{
    SetConsoleOutputCP(1251); // ”станавливает кодировку вывода на консоль (кириллица)
    setlocale(LC_ALL, "866"); // ”станавливает кодовую таблицу CP866
    int day, month;
    printf(" онвертац≥€ дати\n”вага! якщо буде введено б≥льше 4 цифр,\nњх залишок буде про≥гноровано.\n");
    anothertry: // метка дл€ повторного ввода 
    printf("”вед≥ть дату у формат≥ ƒƒ ћћ: "); // ¬вод даты
    scanf("%d%2d", &day, &month);
    if (fakedata(day, month) == 0) // ѕроверка даты на корректность с помощью функциии fakedata
    {
        printf("¬и ввели некорректну дату, будь ласка спробуйте ще раз.\n"); scanf("%*[^\n]"); goto anothertry; //переход к метке дл€ повторного ввода
    }
    else
        printf("%s %s\n", days[day - 1], monthes[month - 1]); // ¬ывод даты
    system("pause");
    return 0;
}